In [1]:
import numpy as np
import pandas as pd

In [2]:
d = {'A': [1,2,np.nan], 'B': [5,np.nan,np.nan],'C': [1,2,3]}

In [3]:
df = pd.DataFrame(d)

In [4]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [6]:
df.dropna() #drop null values among the rows

     A    B  C
0  1.0  5.0  1

In [7]:
df.dropna(axis=1) #drop null values among the rows

   C
0  1
1  2
2  3

In [11]:
df.dropna(thresh = 2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [13]:
df.fillna(value='FILL_VALUE') #fills the null cells withe what every the specified value is.

            A           B  C
0           1           5  1
1           2  FILL_VALUE  2
2  FILL_VALUE  FILL_VALUE  3

In [16]:
df['A'].fillna(value= df['A'].mean()) #fills in the null cells with the mean of the column

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64